Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkAttributes.LineWidthOffsetLeft Property
 The offset from the start of the line on the left side of the section mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double LineWidthOffsetLeft { get; set; }
Public Property LineWidthOffsetLeft As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SectionMarkBase.SectionMarkAttributes Class
Tekla.Structures.Drawing Namespace